n = int(input("لطفاً تعداد تیله ها را وارد کن: "))
nobat = n % 3 != 0  # 1 برای شما، 0 برای کامپیوتر

while n > 0:
    if nobat:
        x = n % 3 or 1
        print(f'من {x} تیله از روی میز برمی‌دارم.')
        n -= x
    else:
        y = int(input("چند تا تیله میخوای برداری: "))
        if y not in (1, 2):
            print("تعداد تیله‌های اشتباه برداشتی. باید 1 یا 2 تیله برداری.")
            continue
        n -= y

    print(f'الان {n} تیله روی میز مونده.')
    nobat = not nobat

print('فکر کردی زرنگی، ولی من برنده شدم چون دیگه هیچ تیله‌ای روی میز نیست. ها ها ها ها ها...')